Repository: saySnake/Telegram-pub
Catalog: Telegraph/*.lproj/InfoPlist.strings
Languages: es, it, zh_hans

# NSContactsUsageDescription
source: Telegram will continuously upload your contacts to its heavily encrypted cloud servers to let you connect with your friends across all your devices.
es: Telegram subirá continuamente tus contactos a sus servidores fuertemente cifrados, para permitirte interactuar con tus amigos en todos tus dispositivos.
it: Telegram caricher√† continuamente i tuoi contatti sui suoi server cloud altamente criptati per farti connettere con i tuoi amici da tutti i tuoi dispositivi.
zh_hans: HotTalk将您的联系人在云端存储加密，让您可以连接到所有设备上的朋友。

# NSLocationWhenInUseUsageDescription
source: When you send your location to your friends, Telegram needs access to show them a map.
es: Cuando envías tu ubicación a tus amigos, Telegram necesita acceso para mostrarles un mapa.
it: Quando invii la tua posizione ai tuoi amici, Telegram ha bisogno di accedere per mostrare loro la mappa.
zh_hans: 当您将您的位置发送给您的朋友时，HotTalk需要访问才能显示地图。

# NSLocationAlwaysUsageDescription
source: When you choose to share your live location with friends in a chat, Telegram needs background access to your location to keep them updated for the duration of the live sharing. You also need this to send locations from an Apple Watch.
es: Cuando envías tu ubicación a tus amigos, Telegram necesita acceso para mostrarles un mapa. También es requerido para enviar ubicaciones desde un Apple Watch.
it: Quando invii la tua posizione ai tuoi amici, Telegram ha bisogno di accedere per mostrare loro la mappa. Ti serve anche per inviare posizioni da Apple Watch.
zh_hans: 您还需要从Apple Watch发送位置，当您将您的位置发送给您的朋友时，HotTalk需要访问才能显示地图。

# NSCameraUsageDescription
source: We need this so that you can take and share photos and videos.
es: Es requerido para que puedas hacer fotos y vídeos.
it: Ci serve per farti scattare, registrare e condividere foto e video.
zh_hans: 我们需要访问摄像头，以便您可以拍摄、分享照片和视频。

# NSPhotoLibraryUsageDescription
source: We need this so that you can share photos and videos from your photo library.
es: Es requerido para que puedas compartir fotos y vídeos desde tu biblioteca de fotos.
it: Ci serve per farti condividere foto e video dalla tua libreria foto.
zh_hans: 我们需要访问相册，以便您可以从照片库共享照片和视频。

# NSMicrophoneUsageDescription
source: We need this so that you can record and share voice messages and videos with sound.
es: Es requerido para que puedas grabar y compartir mensajes de voz y vídeos con sonido.
it: Ci serve per farti registrare e condividere messaggi vocali e video con il sonoro.
zh_hans: 我们需要访问麦克风，以便您可以使用声音录制、共享语音留言和视频。

# NSSiriUsageDescription
source: You can use Siri to send messages.
es: Puedes usar Siri para enviar mensajes.
it: Puoi usare Siri per inviare messaggi.
zh_hans: 您可以使用Siri发送消息。

# NSLocationAlwaysAndWhenInUseUsageDescription
source: When you choose to share your Live Location with friends in a chat, Telegram needs background access to your location to keep them updated for the duration of the live sharing.
es: Cuando eliges compartir tu ubicación en tiempo real con amigos en un chat, Telegram necesita acceso en segundo plano a tu ubicación para mantenerla actualizada mientras la función esté en uso.
it: Quando scegli di condividere la tua Posizione Attuale con gli amici in una chat, Telegram ha bisogno dell'accesso in background alla tua posizione per tenerli aggiornati durante la durata della condivisione della posizione.
zh_hans: 当您选择在聊天中与朋友分享您的现场位置时，电报需要后台访问您的位置，以便在实时共享期间更新它们。

# NSPhotoLibraryAddUsageDescription
source: We need this so that you can save photos and videos to your photo library.
zh_hans: 我们需要访问相册，以便您可以吧照片和视频添加到照片库。
